In [7]:
import pandas as pd

In [9]:
df =pd.read_csv('G23_Fashion â€“ Designers  Collections with Fashion Shows_merged (1).csv', sep = ',')

In [10]:
Designers=df.loc[:,['designer_id', 'name', 'nationality',]]

In [11]:
Designers.head(3)

   designer_id            name nationality
0           46   Charles Green     Finland
1           78     Robert Webb   Lithuania
2           12  Elizabeth Reid      Panama

In [12]:
Designers=Designers.sort_values(by='designer_id')

In [13]:
Designers.head(5)

     designer_id           name nationality
233            1    David Horne     Algeria
91             1    David Horne     Algeria
264            1    David Horne     Algeria
366            1    David Horne     Algeria
322            2  Stacy Lindsey     Liberia

In [14]:
Designers.drop_duplicates(inplace=True)

In [15]:
Designers.head(5)

     designer_id           name                    nationality
233            1    David Horne                        Algeria
322            2  Stacy Lindsey                        Liberia
219            3   Mason Garcia                        Reunion
190            4   Joseph Walsh                      Argentina
88             5    Corey Burns  Holy See (Vatican City State)

In [16]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Designers.to_sql('Designers', conexao, if_exists='replace', index=False)
conexao.close()

In [17]:
Collections=df.loc[:,['collection_id', 'style', 'theme','season', 'release_year',]]

In [18]:
Collections.head(3)

   collection_id  style   theme  season  release_year
0            117  whole   story  Spring          2008
1             68    see      if  Winter          2019
2              8  visit  police    Fall          2009

In [19]:
Collections=Collections.sort_values(by='collection_id')

In [20]:
Collections.head(5)

     collection_id     style theme  season  release_year
248              1  cultural  even    Fall          2014
148              1     truth  even    Fall          2014
243              2      life    no  Summer          2012
364              2      life    no  Summer          2012
271              2      each    no  Summer          2012

In [21]:
Collections.drop_duplicates(inplace=True)

In [22]:
Collections.head(5)

     collection_id     style theme  season  release_year
248              1  cultural  even    Fall          2014
148              1     truth  even    Fall          2014
243              2      life    no  Summer          2012
271              2      each    no  Summer          2012
72               2  evidence    no  Summer          2012

In [23]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Collections.to_sql('Collections', conexao, if_exists='replace', index=False)
conexao.close()

In [24]:
Designers_collections=df.loc[:,['designer_id', 'collection_id', 'contribution_percentage',]]

In [25]:
Designers_collections.head(3)

   designer_id  collection_id  contribution_percentage
0           46            117                    85.16
1           78             68                    28.03
2           12              8                    83.98

In [26]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Designers_collections.to_sql('Designers_collections', conexao, if_exists='replace', index=False)
conexao.close()

In [27]:
Fashion_show=df.loc[:,['fashion_id','show_name','venue', 'date',]]

In [28]:
Fashion_show.head(3)

   fashion_id show_name                   venue        date
0           9       but             South Jesse  2025-02-21
1           2       let              Ericaville  2025-01-11
2          15      fact  North Christinaborough  2025-02-10

In [29]:
Fashion_show=Fashion_show.sort_values(by='fashion_id')

In [30]:
Fashion_show.head(3)

     fashion_id show_name             venue        date
226           1     three  East Richardbury  2025-02-11
301           1     three  East Richardbury  2025-02-11
279           1     three  East Richardbury  2025-02-11

In [31]:
Fashion_show.drop_duplicates(inplace=True)

In [32]:
Fashion_show.head(3)

     fashion_id show_name             venue        date
226           1     three  East Richardbury  2025-02-11
206           2       let        Ericaville  2025-01-11
38            3      risk        New Lauren  2025-01-24

In [33]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Fashion_show.to_sql('Fashion_show', conexao, if_exists='replace', index=False)
conexao.close()